<?php

// for 문 : 특정 처리를 반복적으로 구현하고자 할때 사용

// 0부터 5까지 숫자를 출력

// for($i = 1; $i < 6; $i++) {
//     echo "숫자 : ".$i."\n";
// }

// break : 처리중에 break를 만나면 루프 종료
// for($i = 1; $i < 6; $i++) {
//     if($i ===3) {
//         break;
//     }
//     echo "숫자 : ".$i."\n";
// }

// continue문 : 처리중에 continue를 만나면 이후의 처리를 건너뛰고 다음 루프 진행
// for($i = 1; $i < 6; $i++) {
//     if(($i % 2) ===0) {
//         continue;
//     }
//     echo "숫자 : ".$i."\n";
// }

// 구구단 2단 출력
// for($g = 1; $g <= 9; $g++) {
//     echo "2 X ".$g." = ".($g*2)."\n";
// }

// ---------------------
// 다중 루프문
// ---------------------
// for($i = 1; $i < 3; $i++){
//      echo "바깥 loop문 : ".$i."\n";

//      for($z = 1; $z < 3; $z++){
//         echo "안쪽 loop문 : ".$z."\n";
//      }
// }

// 구구단 2~9단을 출력
// 예시)
// ** 2단 **
// 2 X 1 = 2
// 2 X 2 = 4
// ...
// ** 3단 **
// 3 X 1 = 3
// 3 X 2 = 6
// ...
// 9 X 8 = 72
// 9 X 9 = 81

// for($dan = 2; $dan <= 9; $dan++) {
//     echo "** ".$dan."단 **\n";

//     for($multi = 1; $multi <= 9; $multi++) {
//         echo $dan." X ".$multi." = ".($dan * $multi)."\n";
//     }
// }

// 아래처럼 별을 찍어주세요.
// 예시)
// *****
// *****
// *****
// *****
// *****
// for($stack = 1; $stack <=5; $stack++){
//     echo "*****\n";
// }

// 아래처럼 별을 찍어주세요.
// 예시)
// *
// **
// ***
// ****
// *****
// for($stack1 = 1; $stack1 <=5; $stack1++) {
//     for($stack2 = 1; $stack2 <= $stack1; $stack2++ ){
//         echo "*";
//     }
//     echo "\n";
// }

// for($a = 1; $a <=5; $a++) {
//     for($b = (5-$a); $b >= 1; $b--){
//         echo " ";
//     }
//     for($c = 1; $c <= $a; $c++){
//         echo "*";
//     }
//     echo "\n";
// }

// 구구단 6단
for($g = 1; $g <= 9; $g++) {
     echo "6 X ".$g." = ".($g*6)."\n";
}